# PlacementRight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlacementRight Property
ParameterTypeId Class See Also
---
"Right"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlacementRight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlacementRight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlacementRight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace